In [39]:
import pandas as pd   #pd.DataFrame(), pandas.DataFrame()
import numpy as np
from pandas import DataFrame #DataFrame()
#from pandas import * #DataFrame()

Empty DataFrame
Columns: []
Index: []

In [9]:
pd.read_csv("test_text.txt", sep="|")
#디폴트 행 인덱스: 0번~
pd.read_csv("test_text.txt", sep="|", index_col='ID')
pd.read_csv("test_text.txt", sep="|", index_col=0)

   LAST_NAME  AGE
ID
1        KIM   25
2        LEE   22
3       PARK   33
4       CHOI   24
5        CHO   30

In [14]:
pd.read_csv("test_text_without_name.txt", sep="|", index_col=0)
#header=있음,  디폴트 설정되어 있음
pd.read_csv("test_text_without_name.txt", sep="|",index_col=0)

SyntaxError: positional argument follows keyword argument (<ipython-input-14-8b45eab8ad85>, line 3)

In [24]:
pd.read_csv("test_text.txt", sep="|", skiprows=2)
#연속적으로 여러 줄을 건너뛸경우

pd.read_csv("test_text.txt", sep="|", skiprows=[0,2])
#비연속적으로 여러 줄을 건너뛸경우

data=pd.read_csv("test_text.txt", sep="|", nrows=3)
#3줄만 불러오기
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
ID           3 non-null int64
LAST_NAME    3 non-null object
AGE          3 non-null int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

In [26]:
#결측값
data=pd.read_csv("test_text_na.txt", sep="|")
data.info()
data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
ID           5 non-null int64
LAST_NAME    5 non-null object
AGE          5 non-null object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

   ID LAST_NAME AGE
0   1       KIM  25
1   2       LEE  없음
2   3      PARK  33
3   4        모름  24
4   5       CHO  30

In [28]:
#결측값(na == nan(not a number))
data=pd.read_csv("test_text_na.txt", sep="|", na_values=["없음", "모름"])
data.info()
data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
ID           5 non-null int64
LAST_NAME    4 non-null object
AGE          4 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

   ID LAST_NAME   AGE
0   1       KIM  25.0
1   2       LEE   NaN
2   3      PARK  33.0
3   4       NaN  24.0
4   5       CHO  30.0

In [32]:
#데이터 타입 지정
data=pd.read_csv("test_text.txt", sep="|",
                dtype={'ID':int, 
                      'LAST_NAME':str,
                      'AGE':str})
data.info()
data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
ID           5 non-null int32
LAST_NAME    5 non-null object
AGE          5 non-null object
dtypes: int32(1), object(2)
memory usage: 228.0+ bytes

   ID LAST_NAME AGE
0   1       KIM  25
1   2       LEE  22
2   3      PARK  33
3   4      CHOI  24
4   5       CHO  30

In [41]:
from pandas import DataFrame

#딕셔너리 데이터로 데이터프레임 생성하기
df=DataFrame({
    'id':['a1','a2','a3','a4','a5'],
    'x1':[1,2,3,4,5],
    'x2':[1.1,2.2,3.3,4.4,5.5]
})
#DataFrame.to_csv함수:데이터프레임을 csv로 저장

df

   id  x1   x2
0  a1   1  1.1
1  a2   2  2.2
2  a3   3  3.3
3  a4   4  4.4
4  a5   5  5.5

In [46]:
from pandas import DataFrame
#함수명(인수1,인수2,인수3)
#딕셔너리 데이터로 데이터프레임 생성하기
df=DataFrame({                       #data= {}
    'id':['a1','a2','a3','a4','a5'],
    'x1':[1,2,3,4,5],
    'x2':[1.1,2.2,3.3,4.4,5.5]
}, index=['a','b','c','d','e'])
#DataFrame.to_csv함수:데이터프레임을 csv로 저장

df

   id  x1   x2
a  a1   1  1.1
b  a2   2  2.2
c  a3   3  3.3
d  a4   4  4.4
e  a5   5  5.5

In [50]:
from pandas import DataFrame

df=DataFrame({                       
    'id':['a1','a2','a3','a4','a5'],
    'x1':[1,2,3,4,5],
    'x2':[1.1,2.2,3.3,4.4,5.5]
}, index=['a','b','c','d','e'])
df

#결측값으로 구성된 새로운 행 추가
df2=df.reindex(['a','b','c','d','e','f'])
df2

df.reindex(['a','k','c','e','f'])

    id   x1   x2
a   a1  1.0  1.1
k  NaN  NaN  NaN
c   a3  3.0  3.3
e   a5  5.0  5.5
f  NaN  NaN  NaN

In [52]:
df2.to_csv("df2.csv")

In [53]:
df2.to_csv("df3.csv", sep="$")

In [57]:
df2

    id   x1   x2
a   a1  1.0  1.1
b   a2  2.0  2.2
c   a3  3.0  3.3
d   a4  4.0  4.4
e   a5  5.0  5.5
f  NaN  NaN  NaN

In [60]:
df2.to_csv("df4.csv", na_rep='NaN', float_format="%.2f")

In [63]:
df2.to_csv("df5.csv", na_rep='NaN', columns=['id','x2'])

In [64]:
df2.to_csv("df6.csv", na_rep='NaN', columns=['id','x2'], index=False)

In [65]:
from pandas import DataFrame as df

In [79]:
df1=df(data=np.arange(8).reshape(4,2),
  columns=['col0','col1'],
  index=['row0','row1','row2','row3'])
type(df1)

pandas.core.frame.DataFrame

In [80]:
df1
#transpose matrix

      col0  col1
row0     0     1
row1     2     3
row2     4     5
row3     6     7

In [83]:
df1.T

      row0  row1  row2  row3
col0     0     2     4     6
col1     1     3     5     7

In [84]:
df1.axes     #axis(축,단수), axes(복수)

[Index(['row0', 'row1', 'row2', 'row3'], dtype='object'),
 Index(['col0', 'col1'], dtype='object')]

In [85]:
df1.dtypes

col0    int32
col1    int32
dtype: object

In [86]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, row0 to row3
Data columns (total 2 columns):
col0    4 non-null int32
col1    4 non-null int32
dtypes: int32(2)
memory usage: 224.0+ bytes

In [88]:
df1.shape

(4, 2)

In [89]:
df1.size #8=4*2

8

In [90]:
df1.values

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7]])

In [95]:
np.random.randn(5) #평균:0, 표준편차:1 인 분포로부터 난수 발생

array([ 0.72807685, -0.6578251 , -0.76192566, -0.31577717, -0.33692513])

In [97]:
df=DataFrame({"cls_1":['a','a','b','b','c'],
         "v1":np.arange(5),
         "v2":np.random.randn(5)},
         index=['r0','r1','r2','r3','r4']
         )

In [98]:
df.index

Index(['r0', 'r1', 'r2', 'r3', 'r4'], dtype='object')

In [100]:
df

   cls_1  v1        v2
r0     a   0 -0.213507
r1     a   1 -0.900691
r2     b   2  0.971320
r3     b   3 -0.720389
r4     c   4 -0.067623

In [107]:
import warnings
warnings.filterwarnings(action='ignore')

df.ix[2] #행 위치(0번부터 시작)
df.ix['r2'] #행 인덱스 이름
#ix는 행 단위 indexing할때, 
#행위치(정수)와 행 인덱스 이름을 모두 사용할 수 있다

#인덱스 3번부터 마지막까지 추출
df.ix[3:]
df.ix['r3':]

   cls_1  v1        v2
r3     b   3 -0.720389
r4     c   4 -0.067623

In [110]:
df
df.head(3)
df.tail(3)

   cls_1  v1        v2
r2     b   2  0.971320
r3     b   3 -0.720389
r4     c   4 -0.067623

In [111]:
df

   cls_1  v1        v2
r0     a   0 -0.213507
r1     a   1 -0.900691
r2     b   2  0.971320
r3     b   3 -0.720389
r4     c   4 -0.067623

In [119]:
df['cls_1']
df.cls_1

r0    a
r1    a
r2    b
r3    b
r4    c
Name: cls_1, dtype: object

In [129]:
type(df[['cls_1']]) #dataframe
type(df['cls_1'])   #Series

pandas.core.series.Series

In [130]:
df=DataFrame({"cls_1":['a','a','b','b','c'],
         "v1":np.arange(5),
         "v2":np.random.randn(5)},
         index=['r0','r1','r2','r3','r4']
         )
df

   cls_1  v1        v2
r0     a   0  1.099101
r1     a   1  0.269020
r2     b   2 -0.170854
r3     b   3 -1.303524
r4     c   4  2.159383

In [131]:
#행 인덱스 : r3, r4 제거, r5,r6가 추가

df.reindex(['r0','r1','r2','r5','r6'])

   cls_1   v1        v2
r0     a  0.0  1.099101
r1     a  1.0  0.269020
r2     b  2.0 -0.170854
r5   NaN  NaN       NaN
r6   NaN  NaN       NaN

In [135]:
df.reindex(['r0','r1','r2','r5','r6'], fill_value=0)
df.reindex(['r0','r1','r2','r5','r6'], fill_value='missing')
df.reindex(['r0','r1','r2','r5','r6'], fill_value='NA')

   cls_1  v1        v2
r0     a   0    1.0991
r1     a   1   0.26902
r2     b   2 -0.170854
r5    NA  NA        NA
r6    NA  NA        NA

In [142]:
#시계열 데이터:DataFrame에서 index를 만들때 date_range함수 사용
date_idx=pd.date_range("1/7/2020", periods=5, freq="D")

In [143]:
df2=pd.DataFrame({"c1":[5,3,7,6,4]})
df2

   c1
0   5
1   3
2   7
3   6
4   4

In [144]:
df2=pd.DataFrame({"c1":[5,3,7,6,4]},index=date_idx)
df2

            c1
2020-01-07   5
2020-01-08   3
2020-01-09   7
2020-01-10   6
2020-01-11   4

In [146]:
date_idx2=pd.date_range("1/1/2020", periods=20, freq="D")

In [154]:
# df3=pd.DataFrame({"c1":[5,3,7,6,4]},index=date_idx2) 에러
# df3

df2.reindex(date_idx2, method="ffill") #fill_value=0
df2.reindex(date_idx2, method="bfill")

             c1
2020-01-01  5.0
2020-01-02  5.0
2020-01-03  5.0
2020-01-04  5.0
2020-01-05  5.0
2020-01-06  5.0
2020-01-07  5.0
2020-01-08  3.0
2020-01-09  7.0
2020-01-10  6.0
2020-01-11  4.0
2020-01-12  NaN
2020-01-13  NaN
2020-01-14  NaN
2020-01-15  NaN
2020-01-16  NaN
2020-01-17  NaN
2020-01-18  NaN
2020-01-19  NaN
2020-01-20  NaN